# vim:ft=ruby

if OS.mac?
  # Taps
  ### tap "homebrew/cask-fonts"
  ### tap "koekeishiya/formulae"
  ### tap "pkgxdev/made"

  ### brew "noti" # utility to display notifications from scripts
  ### brew "trash" # rm, but put in the trash rather than completely delete

  # Applications
  ### cask "kitty" # a better terminal emulator
  ### cask "imageoptim" # a tool to optimize images
  ### cask "1password/tap/1password-cli"
  ### cask "wezterm" # a better terminal emulator

  # Aerospace
  ### cask "nikitabobko/tap/aerospace" # AeroSpace is an i3-like tiling window manager for macOS

  # Fonts
  cask "font-fira-code"
  cask "font-jetbrains-mono"
  cask "font-cascadia-mono"
  cask "font-symbols-only-nerd-font"
  cask "font-recursive-code"
  cask "font-monaspace"

  cask  "minisim" # A simple way to launch mobile simulators
elsif OS.linux?
  brew "xclip" # access to clipboard (similar to pbcopy/pbpaste)
end

tap "homebrew/bundle"

# Utilities
cask "db-browser-for-sqlite"
brew "sqldiff"
brew "sqlite"
brew "sqlite-analyzer"
cask "appcleaner"
cask "etrecheckpro"
cask "onyx"

# Third party apps
cask "1password/tap/1password-cli"
cask "1password"
cask "alfred"
cask "anki"
cask "anydesk"
cask "balenaetcher"
cask "bbedit"
cask "betterzip"
cask "beyond-compare"
cask "brave-browser"
cask "cloudflare-warp"
cask "default-folder-x"
cask "discord"
cask "docker"
cask "dropbox"
cask "easyfind"
cask "firefox"
cask "flux"
cask "imageoptim"
cask "macs-fan-control"
cask "path-finder"
cask "sequel-ace"
cask "slack"
cask "softraid"
cask "spamsieve"
cask "superduper"
cask "torguard"
cask "visual-studio-code"
cask "wezterm" # a better terminal emulator
cask "zoom"

# VS Code extentions
vscode "alexcvzz.vscode-sqlite"
vscode "alfredbirk.tailwind-documentation"
vscode "austenc.tailwind-docs"
vscode "bradlc.vscode-tailwindcss"
vscode "bradymholt.pgformatter"
vscode "christian-kohler.npm-intellisense"
vscode "codeium.codeium"
vscode "codium.codium"
vscode "csstools.postcss"
vscode "davidwang.ini-for-vscode"
vscode "dtsvet.vscode-wasm"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "fivethree.vscode-svelte-snippets"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "gitpod.gitpod-desktop"
vscode "gruntfuggly.todo-tree"
vscode "hbenl.vscode-test-explorer"
vscode "hextorgb.hex-to-rgb"
vscode "jinxdash.prettier-rust"
vscode "kalimahapps.tailwind-config-viewer"
vscode "kalimahapps.tailwindcss-kit"
vscode "matthewpi.caddyfile-support"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "miramac.vscode-exec-node"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.test-adapter-converter"
vscode "mskelton.playwright-test-snippets"
vscode "naumovs.color-highlight"
vscode "nwallace.peep"
vscode "phind.phind"
vscode "pivaszbs.svelte-autoimport"
vscode "rust-lang.rust-analyzer"
vscode "ryu1kn.partial-diff"
vscode "samuelcolvin.jinjahtml"
vscode "sandcastle.vscode-open"
vscode "scootersoftware.bcompare-vscode"
vscode "snyk-security.snyk-vulnerability-scanner"
vscode "sonarsource.sonarlint-vscode"
vscode "sourcegraph.cody-ai"
vscode "stivo.tailwind-fold"
vscode "streetsidesoftware.code-spell-checker"
vscode "surrealdb.surrealql"
vscode "svelte.svelte-vscode"
vscode "swellaby.vscode-rust-test-adapter"
vscode "tamasfe.even-better-toml"
vscode "unifiedjs.vscode-mdx"
vscode "uniquevision.vscode-plpgsql-lsp"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vivaxy.vscode-conventional-commits"
vscode "yzhang.markdown-all-in-one"

# Packages
cask "nikitabobko/tap/aerospace" # AeroSpace is a tiling window manager for macOS
brew "ansible" # Remote server configurator
brew "bat" # better cat
brew "cloc" # lines of code counter
brew "entr" # file watcher / command runner
brew "eza" # ls alternative
brew "fd" # find alternative
brew "fnm" # Fast Node version manager
brew "fzf" # Fuzzy file searcher, used in scripts and in vim
brew "gawk" # GNU awk utility
brew "gcc" # GNU compiler collection
brew "gdbm" # GNU database manager
brew "gh" # GitHub CLI
brew "git" # Git version control (latest version)
brew "git-delta" # a better git diff
brew "glow" # markdown viewer
brew "gnupg" # GPG
brew "grep" # grep (latest)
brew "highlight" # code syntax highlighting
brew "htop" # a top alternative
brew "jq" # work with JSON files in shell scripts
brew "lazygit" # a better git UI
brew "llvm" # Next-gen compiler infrastructure
brew "make" # Utility for directing compilation
brew "mysql" # Open source relational database management system
brew "neofetch" # pretty system info
brew "noti" # utility to display notifications from scripts
### brew "neovim" # A better vim
tap "pkgxdev/made" # required for pkgx
brew "pkgxdev/made/pkgx" # npx, but for anything
brew "python" # python (latest)
cask "qlimagesize" # Display image info and preview unsupported formats in QuickLook
cask "qlmarkdown" # Quick Look generator for Markdown files
cask "qlvideo" # Thumbnails, static previews, cover art and metadata for video files
brew "ripgrep" # very fast file searcher
brew "shellcheck" # diagnostics for shell sripts
brew "starship" # Cross-shell prompt for astronauts
brew "stow" # symlink farm manager
brew "stylua" # lua code formatter
### brew "tmux" # terminal multiplexer
brew "trash" # rm, but put in the trash rather than completely delete
brew "tree" # pretty-print directory contents
brew "vim" # Vim (latest)
brew "wdiff" # word differences in text files
brew "wget" # internet file retriever
brew "whalebrew" # Homebrew, but with Docker images
brew "wrk" # HTTP benchmarking tool
brew "z" # switch between most used directories
brew "zoxide" # switch between most used directories
brew "zsh" # zsh (latest)
brew "zstd" # real-time compression algorithm

# MAS Mac App Store
brew "mas"
# App Store apps
mas "1Password for Safari", id: 1569813296
mas "GarageBand", id: 682658836
mas "Ghostery Privacy Ad Blocker", id: 6504861501
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Peek", id: 1554235898 # Quick look extension
mas "RegExRx", id: 498370702
mas "Xcode", id: 497799835
